# Create the model
import google.generativeai as genai


def traits_model(traits):
    genai.configure(api_key='AIzaSyACk1QpGciLknlSq-M0as-m4_Vk1vfA6To')

    # See https://ai.google.dev/api/python/google/generativeai/GenerativeModel
    generation_config = {
        "temperature": 1,
        "top_p": 0.95,
        "top_k": 64,
        "max_output_tokens": 8192,
        "response_mime_type": "text/plain",
    }
    safety_settings = [
        {
            "category": "HARM_CATEGORY_HARASSMENT",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
        {
            "category": "HARM_CATEGORY_HATE_SPEECH",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
        {
            "category": "HARM_CATEGORY_SEXUALLY_EXPLICIT",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
        {
            "category": "HARM_CATEGORY_DANGEROUS_CONTENT",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
    ]

    traits_model = genai.GenerativeModel(
        model_name="gemini-1.5-flash-latest",
        safety_settings=safety_settings,
        generation_config=generation_config,
        system_instruction="מערכת שמנתחת קורות חיים של משתמש ומבינה את התכונות החזקות שלו",
    )

    traits_chat_session = traits_model.start_chat(
        history=[
            {
                "role": "user",
                "parts": [
                    "הקורות חיים הבאים הם של מתמודד לעבודה שלי אני רוצה להסיק מהקורות חיים מה היכולות הבין אישיות שיש לו אשמח אם תוכל לכתוב לי תשובה בפורמט json של התכונות בלבד \nמבלי פירוט של כל היכולות הבין אישיות שלו שאתה מסיק מהקורות חיים\nאת התכונות הבין אישיות תבחר מבין התכונות אישיות הבאות "+ traits +" ",
                    "שלומי גולדשטיין\nקיבוץ גליל, צפון ישראל\nאימייל: shlomi.goldstein@example.com\nטלפון: +972-50-123-4567\nלינקדאין: linkedin.com/in/shlomigoldstein\n\n---------------------------------------------\nמטרה\n---------------------------------------------\nאיש חקלאות מסור עם 10 שנות ניסיון בחקלאות וניהול חקלאי בצפון ישראל. מחפש משרה כמנהל חקלאי כדי לנצל את המומחיות שלי בגידול גידולים, ניהול חוות ושיטות חקלאות ברת קיימא.\n\n---------------------------------------------\nניסיון מקצועי\n---------------------------------------------\n\nמנהל חקלאי\nקיבוץ גליל, צפון ישראל\nינואר 2014 - היום\n- ניהל 200 דונם של אדמות חקלאיות, פיקח על גידולים שונים כולל פירות הדר, זיתים וירקות.\n- יישם מערכות השקיה מודרניות, שהובילו לעלייה של 20% ביעילות המים.\n- פיקח על צוות של 30 עובדים חקלאיים, סיפק הכשרה בשיטות חקלאות ברות קיימא ופרקטיקות בטיחות.\n- ביצע ניתוחי קרקע ותכנון סבב גידולים לשמירה על בריאות הקרקע ושיפור התפוקה.\n- פיתח ושמר על קשרים עם מפיצים ושווקים מקומיים, להבטחת מכירת התוצרת במועד.\n\nמפקח חווה\nקיבוץ גליל, צפון ישראל\nינואר 2010 - דצמבר 2013\n- סייע בתפעול היומיומי של החווה, כולל שתילה, קציר ותחזוקת ציוד.\n- פיקח על בריאות הגידולים ויישם אמצעי הדברת מזיקים להפחתת אובדן יבולים.\n- תיאם עם מרכז המחקר החקלאי לאימוץ שיטות וטכנולוגיות חקלאיות חדשניות.\n- שמר על רשומות של פעילויות חקלאיות, מלאי ועסקאות פיננסיות.\n- השתתף בתוכניות קהילתיות לקידום חקלאות בת קיימא וחקלאות אורגנית.\n\n---------------------------------------------\nהשכלה\n---------------------------------------------\n\nתואר ראשון במדעי החקלאות\nהאוניברסיטה העברית בירושלים, קמפוס רחובות, ישראל\nסיום: יוני 2009\n\n---------------------------------------------\nתעודות\n---------------------------------------------\n\n- טכנאי חקלאי מוסמך, משרד החקלאות ופיתוח הכפר, ישראל\n- תעודה בחקלאות בת קיימא, הטכניון – מכון טכנולוגי לישראל\n\n---------------------------------------------\nכישורים\n---------------------------------------------\n\n- ניהול חווה\n- גידול גידולים\n- שיטות חקלאות ברות קיימא\n- מערכות השקיה\n- ניתוח קרקע\n- הדברת מזיקים\n- מנהיגות צוות\n- הפעלת ציוד חקלאי\n- ניתוח נתונים ושמירת רשומות\n- תיאום שוק\n\n---------------------------------------------\nשפות\n---------------------------------------------\n\n- עברית (שפת אם)\n- אנגלית (שוטפת)\n\n---------------------------------------------\nהמלצות\n---------------------------------------------\n\nזמין לפי דרישה\n",
                ],
            },
            {
                "role": "model",
                "parts": [
                    "```json\n{\n  \"תכונות\": [\n    \"מנהיגות\",\n    \"עבודת צוות\",\n    \"תקשורת\",\n    \"יכולת הדרכה\",\n    \"שיתוף פעולה\",\n    \"מסוגלות\"\n  ]\n}\n```\n",
                ],
            },
        ]
    )
    return traits_chat_session
