"""
Install the Google AI Python SDK

$ pip install google-generativeai

See the getting started guide for more information:
https://ai.google.dev/gemini-api/docs/get-started/python
"""
import google.generativeai as genai

def fields_model(fields):
    genai.configure(api_key='AIzaSyACk1QpGciLknlSq-M0as-m4_Vk1vfA6To')

    # Create the model
    # See https://ai.google.dev/api/python/google/generativeai/GenerativeModel
    generation_config = {
        "temperature": 1,
        "top_p": 0.95,
        "top_k": 64,
        "max_output_tokens": 8192,
        "response_mime_type": "text/plain",
    }
    safety_settings = [
        {
            "category": "HARM_CATEGORY_HARASSMENT",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
        {
            "category": "HARM_CATEGORY_HATE_SPEECH",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
        {
            "category": "HARM_CATEGORY_SEXUALLY_EXPLICIT",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
        {
            "category": "HARM_CATEGORY_DANGEROUS_CONTENT",
            "threshold": "BLOCK_MEDIUM_AND_ABOVE",
        },
    ]
    fields_model = genai.GenerativeModel(
        model_name="gemini-1.5-flash-latest",
        safety_settings=safety_settings,
        generation_config=generation_config,
        system_instruction="בהתנן קורות חיים של אני מגיש אליך, תוציא את עולמות העבודה של קורות החיים הנמצאים ברשימה בסיסית",
    )

    fields_chat_session = fields_model.start_chat(
        history=[
            {
                "role": "user",
                "parts": ["הקורות חיים הבאים הם של מתמודד לעבודה שלי אני רוצה להסיק מהקורות חיים מה מקצועות הרלוונטיים לו אשמח אם תוכל לכתוב לי תשובה בפורמט json של מקצועות בלבד :המקצוע חייב להיות מהרשימה אם המקצוע לא נמצא ברשימה תחזיר תשובה ריקה" + fields + "",
                  "רונית לוי\nקיבוץ גליל עליון, צפון ישראל\nאימייל: ronit.levi@example.com\nטלפון: +972-50-987-6543\nלינקדאין: linkedin.com/in/ronitlevi\n\n---------------------------------------------\nמטרה\n---------------------------------------------\nמורה מנוסה עם 4 שנות ניסיון בהוראה בבתי ספר בצפון ישראל. מחפשת משרה בהוראה בתחום החינוך היסודי או העל-יסודי כדי להשתמש בידע ובמיומנויות שלי לטובת קידום חינוכי ולימודי של התלמידים.\n\n---------------------------------------------\nניסיון מקצועי\n---------------------------------------------\n\nמורה לכיתות ד'-ו'\nבית ספר יסודי הרים, קריית שמונה, ישראל\nספטמבר 2019 - היום\n- הוראה במקצועות מתמטיקה, מדעים ואנגלית לתלמידי כיתות ד'-ו'.\n- פיתוח והעברת שיעורים פרונטליים ומקוונים תוך שימוש בטכנולוגיות חינוכיות.\n- מעקב אחר התקדמות התלמידים והתאמת תוכניות לימודים לפי הצרכים האישיים.\n- שיתוף פעולה עם צוות ההוראה וההנהלה ליצירת סביבה לימודית תומכת ומקדמת.\n- ארגון והשתתפות בטיולים ופעילויות חוץ-כיתתיות לקידום למידה חווייתית.\n\nמורה מחליפה\nבית ספר על-יסודי גולן, קצרין, ישראל\nספטמבר 2018 - אוגוסט 2019\n- הוראה במקצועות שונים לתלמידי כיתות ז'-י'.\n- תמיכה בתלמידים בעלי קשיי למידה ומתן שיעורי תגבור.\n- השתתפות בישיבות צוות והדרכות מקצועיות.\n\n---------------------------------------------\nהשכלה\n---------------------------------------------\n\nתואר ראשון בחינוך והוראה\nהמכללה האקדמית תל-חי, ישראל\nסיום: יוני 2018\n\n---------------------------------------------\nתעודות\n---------------------------------------------\n\n- תעודת הוראה בחינוך היסודי, משרד החינוך\n- תעודת הוראה באנגלית, משרד החינוך\n\n---------------------------------------------\nכישורים\n---------------------------------------------\n\n- יכולות הוראה ופיתוח תוכניות לימודים\n- כישורי ניהול כיתה\n- יכולת תקשורת בין-אישית מצוינת\n- שימוש בטכנולוגיות חינוכיות\n- מעקב והערכה אחר התקדמות תלמידים\n- יכולת עבודה בצוות\n\n---------------------------------------------\nשפות\n---------------------------------------------\n\n- עברית (שפת אם)\n- אנגלית (שוטפת)\n\n---------------------------------------------\nהמלצות\n---------------------------------------------\n\nזמין לפי דרישה",],
            },
            {
                "role": "model",
                "parts": [
                    "```json\n{\n  \"תכונות\": [\n    \"מורה\"\n  ]\n}\n```",
                ],
            },
        ]
    )
    return fields_chat_session
